In [126]:
people = ['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 'Dr. Daniel Romero']

# def split_title_and_name(person):
#     title = person.split()[0]
#     lastname = person.split()[-1]
#     return '{} {}'.format(title, lastname)

# list(map(split_title_and_name, people))

print(people)
print(people[0])
print(people[0].split())
people[0].split('.')

['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 'Dr. Daniel Romero']
Dr. Christopher Brooks
['Dr.', 'Christopher', 'Brooks']

['Dr', ' Christopher Brooks']

In [37]:
my_function = lambda x,y,z: x*y
my_function(2,4,6)

my_list1=[] #list of even numbers
for i in range(50):
    if i%2 == 0:
        my_list1.append(i)
print('my_list is {}'.format(my_list1))

my_list2 =[number for number in range(20) if number%2==0] #list comprehension technique
print('my_list 2 is {}'.format(my_list2))

my_list is [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48]
my_list 2 is [0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

In [8]:
import numpy as np
import math
a = np.array([1,2,3])
a.ndim
a.size
a.shape
b = np.array([[2,3,4.3]]) #double brackets makes the shape 2-dimensional
b.shape
b.ndim
type(b)
b.dtype
b.dtype.name

'float64'

In [4]:
import pandas as pd
students = ['Alice','Tom','Daniel',None]
pd.Series(students)
numbers = [1,2,3,None]
pd.Series(numbers)

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

### Pandas DataFrame

In [1]:
import pandas as pd
df = pd.read_csv("TimeSeriesExample.csv",index_col = 'Date',parse_dates = ['Date'])
df.columns = [x.lower().strip() for x in df.columns]
df_mask = df['non-subscribed'] >= 500
df_mask
df.where(df_mask)   #df.where(df_mask).head()
df.where(df_mask).dropna()
df[df['non-subscribed'] >= 500]
(df['non-subscribed'] >= 500) & (df['subscribed'] >= 5000)
(df['non-subscribed'] >= 300) & (df['non-subscribed'] <= 500) #needs a parenthesis else see below
df['non-subscribed'].gt(300) & df['non-subscribed'].lt(500)  #needs NO parenthesis
#df['non-subscribed'].gt(300).lt(500) #this doesn't work here as above for some reasons
df.head()

            non-subscribed  subscribed
Date
2021-01-01           651.0      1140.0
2021-01-02             NaN      6973.0
2021-01-03           766.0      1090.0
2021-01-04           857.0      5315.0
2021-01-05           594.0      1930.0

### Pandas Indexing

In [65]:
df = pd.read_csv("TimeSeriesExample.csv",index_col = 'Date',parse_dates = ['Date'])
df.columns = [x.lower().strip() for x in df.columns]
df['Date'] = df.index #copy the index data into its own column
df.set_index('non-subscribed',inplace=True) #then set index to the other column.remember to put 'inplace = True' to work
df.reset_index(inplace=True)  #to reset index to default column.remember to put 'inplace = True' to work
df.head()
#df['non-subscribed'].unique()  #for unique values
columns_to_keep = ['non-subscribed','Date'] #to create a DF with sub-columns
df[columns_to_keep].head()

   non-subscribed       Date
0           651.0 2021-01-01
1             NaN 2021-01-02
2           766.0 2021-01-03
3           857.0 2021-01-04
4           594.0 2021-01-05

### Null Values

In [79]:
df = pd.read_csv("TimeSeriesExample.csv",index_col = 'Date',parse_dates = ['Date'])
df.columns = [x.lower().strip() for x in df.columns]
mask = df.isnull()
mask
df.dropna()
#df.fillna(0,inplace=True) #This fill all NAN with 0, and does NOT return a copy but modifies it
df = df.fillna(method = 'bfill') #method could be ffill too for forward filling
df.head()

            non-subscribed  subscribed
Date
2021-01-01           651.0      1140.0
2021-01-02           766.0      6973.0
2021-01-03           766.0      1090.0
2021-01-04           857.0      5315.0
2021-01-05           594.0      1930.0

In [89]:
df = pd.DataFrame({'A':[1,1,2,3,4],'B':[3,4,5,6,9],'C':['a','d','g','j','u'],
                   'Name':['John Smith','George Washington','James Dough','David Platt','Edward Cole']})
# df.replace(1,100) #to replace a single value
# df.replace([1,9],[100,900]) #to replace multiple values.Regex replace can be done too
df
# Using the apply function to split a column by space

def splitname(row):
    row['first'] = row['Name'].split()[0]
    row['last'] = row['Name'].split()[1]
    return row

df.apply(splitname,axis='columns')

   A  B  C               Name   first        last
0  1  3  a         John Smith    John       Smith
1  1  4  d  George Washington  George  Washington
2  2  5  g        James Dough   James       Dough
3  3  6  j        David Platt   David       Platt
4  4  9  u        Edward Cole  Edward        Cole

In [41]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)
obj2['California'] == None
#Nan == Nan

False

In [4]:
staff = pd.DataFrame([{'Name': 'Sally','Role':'Director of HR'},
                      {'Name': 'Kelly','Role':'Grader'},
                      {'Name': 'James','Role':'Registrar'}])#Notice 2 different ways to create a DataFrame (students,Staff)
staff
students = pd.DataFrame({'Name':['James','Sally','Mike'],
                        'School':['Business','Engineering','Law'],})
students = students.set_index("Name")
staff = staff.set_index("Name")
print(students)
print(staff)

pd.merge(staff, students, how = 'outer',left_index = True, right_index = True)
#pd.merge(staff, students, how = 'inner',left_index = True, right_index = True) #by default its inner so 'how' unnecessary

            School
Name
James     Business
Sally  Engineering
Mike           Law
                 Role
Name
Sally  Director of HR
Kelly          Grader
James       Registrar

                 Role       School
Name
James       Registrar     Business
Kelly          Grader          NaN
Mike              NaN          Law
Sally  Director of HR  Engineering

In [15]:
pd.merge(staff, students, how = 'left',left_index = True, right_index = True)#similar to left outerjoin in SQL
pd.merge(staff, students, how = 'right',left_index = True, right_index = True)
staff = pd.DataFrame([{'Name': 'Sally','Role':'Director of HR'},
                      {'Name': 'Kelly','Role':'Grader'},
                      {'Name': 'James','Role':'Registrar'}])#Notice 2 different ways to create a DataFrame (students,Staff)
staff
students = pd.DataFrame({'Name':['James','Sally','Mike'],
                        'School':['Business','Engineering','Law']})
staff
students

pd.merge(staff, students, how = 'right', on = 'Name')

    Name            Role       School
0  Sally  Director of HR  Engineering
1  James       Registrar     Business
2   Mike             NaN          Law

In [17]:
staff = pd.DataFrame([{'Name': 'Sally','Role':'Director of HR','Location':'Washington Avenue'},
                      {'Name': 'Kelly','Role':'Grader','Location':'Jersey Avenue'},
                      {'Name': 'James','Role':'Registrar','Location':'Wilmot Street'}])
students = pd.DataFrame({'Name':['James','Sally','Mike'],
                        'School':['Business','Engineering','Law'],
                        'Location':['234 Monica Street', '4 Avenue South', '1600 Pennsylvania Avenue']})
pd.merge(staff, students, how = 'right', on = 'Name')#for common fields(Location), Location_x and _y are used for left/right

,Location_x,Name,Role,School,Location_y
0,Washington Avenue,Sally,Director of HR,Engineering,4 Avenue South
1,Wilmot Street,James,Registrar,Business,234 Monica Street
2,NaN,Mike,NaN,Law,1600 Pennsylvania Avenue

In [24]:
staff = pd.DataFrame([{'First Name': 'Sally','Last Name': 'Smith','Role':'Director of HR'},
                      {'First Name': 'Kelly','Last Name': 'Smooth','Role':'Grader'},
                      {'First Name': 'James','Last Name': 'Wilde','Role':'Registrar'}])
students = pd.DataFrame({'First Name':['James','Sally','Mike'],
                         'Last Name':['Gunn','Smith','Brooks'],
                        'School':['Business','Engineering','Law']})
print(staff)
print(students)
pd.merge(staff, students, on = 'First Name') #but the James'es are different,so see below
pd.merge(staff, students, on = ['First Name', 'Last Name'])

  First Name Last Name            Role
0      Sally     Smith  Director of HR
1      Kelly    Smooth          Grader
2      James     Wilde       Registrar
  First Name Last Name       School
0      James      Gunn     Business
1      Sally     Smith  Engineering
2       Mike    Brooks          Law

  First Name Last Name            Role       School
0      Sally     Smith  Director of HR  Engineering

In [28]:
college = (staff,students) #similar to union in SQL but here we have different fields in Role& School hence the pink color
pd.concat(college)
pd.concat(college, keys = ['staff','students'])
print(len(staff))

3

C:\Users\daved\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.


C:\Users\daved\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

In [46]:
students1 = pd.DataFrame({'First Name':['James','Sally','Mike'],
                         'Last Name':['Gunn','Smith','Brooks'],
                        'School':['Business','Engineering','Law']}) #Junior
students2 = pd.DataFrame({'First Name':['John','David','Juliet','Charles'],
                         'Last Name':['Gunn','Smith','Brooks','Dunn'],
                        'School':['Business','Engineering','Law','Physics']}) #Senior
college = (students1,students2)
pd.concat(college) #similar to union in SQL
pd.concat(college, keys = ['Junior','Senior'])

# students1
# students1.rename(columns = {'School':'Department'}) #to rename columns

         First Name Last Name       School
Junior 0      James      Gunn     Business
       1      Sally     Smith  Engineering
       2       Mike    Brooks          Law
Senior 0       John      Gunn     Business
       1      David     Smith  Engineering
       2     Juliet    Brooks          Law
       3    Charles      Dunn      Physics

#### Python Functions/Idioms

In [68]:
%timeit 3+1

# n=50
# def First(n):
#     my_list1=[] 
#     for i in range(n):
#         if i%2 == 0:
#             my_list1.append(i)
#     return(my_list1)
# print(First(50))

# def Second(n):
#     my_list2 =[number for number in range(n) if number%2==0] #list comprehension technique
#     return(my_list2)
# print(Second(50))


# timeit.timeit(First,number=10)

9.92 ns ± 0.248 ns per loop (mean ± std. dev. of 7 runs, 100000000 loops each)

In [80]:
import numpy as np
def add2nums(a,b):
    return a+b
%timeit add2nums(3,1)

132 ns ± 3.34 ns per loop (mean ± std. dev. of 7 runs, 10000000 loops each)

In [73]:
%timeit a = [4 + i for i in range(1000)]

72.2 µs ± 3.04 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [77]:
%%timeit
a=[]
for i in range(1000):
    a.append(4+i)

113 µs ± 3.39 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [81]:
%timeit 4 + np.arange(1000)

3.19 µs ± 128 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

### ApplyFunction

In [93]:
df = pd.DataFrame({'a':[5,5,71,67],'b':[6,82,31,37],'c':[20,28,92,49]})
print(df)
def min_max(row):
    data = row[['a','b','c']]
    return pd.Series({'min':np.min(data),'max':np.max(data)})
df.apply(min_max,axis = 'columns') #Horizontal axis
#df.apply(min_max,axis = 0) #not working for some reasons

    a   b   c
0   5   6  20
1   5  82  28
2  71  31  92
3  67  37  49

   min  max
0    5   20
1    5   82
2   31   92
3   37   67

In [95]:
df = pd.DataFrame({'a':[5,5,71,67],'b':[6,82,31,37],'c':[20,28,92,49]})
print(df)
def min_max(row):
    data = row[['a','b','c']]
    row['min'] =np.min(data)
    row['max'] =np.max(data)
    return row
df.apply(min_max,axis = 1) #Horizontal axis

    a   b   c
0   5   6  20
1   5  82  28
2  71  31  92
3  67  37  49

    a   b   c  min  max
0   5   6  20    5   20
1   5  82  28    5   82
2  71  31  92   31   92
3  67  37  49   37   67

In [99]:
row = ['a','b','c']
df.apply(lambda x: np.min(x[row]),axis = 'columns')

0     5
1     5
2    31
3    37
dtype: int64

### Timestamp

In [6]:
pd.Timestamp('9/1/2018 10:09PM') #default is month first
pd.Timestamp(2019,2,7,6,8,9)
pd.Timestamp(2021,3,2,22,10).isoweekday() # Monday = 1 and Sunday = 7
pd.Timestamp(2021,3,2,22,10).minute # to extract either year,month,day,hour,minute,second
pd.Period('3/15/2016')
pd.Period('3/2016')
print(type(pd.Period('3/2016')))
pd.Period('3/2016')+5
pd.Period('3/15/2016')-6

<class 'pandas._libs.tslibs.period.Period'>

Period('2016-03-09', 'D')

In [114]:
t1 = pd.Series(list('abc'),[pd.Timestamp('3/16/2017'),pd.Timestamp('3/17/2017'),pd.Timestamp('3/19/2017')])
t1

2017-03-16    a
2017-03-17    b
2017-03-19    c
dtype: object

In [38]:
import pandas as pd
import numpy as np
d = ['2 June 2013','2016-6-15','7/12/16', 'Aug 27, 2014']
# d = pd.to_datetime(d)
# print(d)
# print(type(d))

t2 = pd.DataFrame(np.random.randint(10,100,(4,2)),index = d,columns = list('ab'))
print(t2)
t2.index = pd.to_datetime(t2.index)
type(t2.index)
t2

# t3 = pd.to_datetime('4.7.23', dayfirst = True)
# t3

               a   b
2 June 2013   31  16
2016-6-15     34  24
7/12/16       68  38
Aug 27, 2014  21  66

Timestamp('2023-07-04 00:00:00')

### Time Deltas

In [49]:
pd.Timestamp('9/3/2019') - pd.Timestamp('9/1/2019')
pd.Timestamp('9/3/2019 8PM') + pd.Timedelta('3D 3H')

Timestamp('2019-09-06 23:00:00')

### Time Offset

In [72]:
pd.Timestamp('3/4/2021').isoweekday() #always use iso,although weekday will work too
pd.Timestamp('3/4/2021') + pd.offsets.Week() #default is one week
pd.Timestamp('3/4/2021') + pd.offsets.Week(3) #3 weeks after
pd.Timestamp('4/4/2021') + pd.offsets.MonthEnd() #month end

Timestamp('2021-04-30 00:00:00')

### Dates in DataFrame

In [92]:
dates = pd.date_range('10-1-16', periods = 9, freq = '2W-SUN') #'2W-SUN' means biweekly every sunday
dates = pd.date_range('3-4-21', periods = 9, freq = 'B') #for business days
dates = pd.date_range('5-4-21', periods = 12, freq = 'Q') #this uses next quarter MonthEnd dates
dates = pd.date_range('3-4-21', periods = 12, freq = 'QS') #this uses next quarter MonthStart dates
dates = pd.date_range('3-4-21', periods = 12, freq = 'QS-JUN') #'QS-JUN' ensure Quarter Starts at JUN
dates

DatetimeIndex(['2021-06-01', '2021-09-01', '2021-12-01', '2022-03-01',
               '2022-06-01', '2022-09-01', '2022-12-01', '2023-03-01',
               '2023-06-01', '2023-09-01', '2023-12-01', '2024-03-01'],
              dtype='datetime64[ns]', freq='QS-JUN')

In [113]:
dates = pd.date_range('10-1-16', periods = 9, freq = '2W-SUN')
df = pd.DataFrame({'Count 1':100 + np.random.randint(-5,10,9),'Count 2':120 + np.random.randint(-5,10,9)},index =  dates)
df.index.weekday_name
print(df)
df.diff()
df.resample('M').sum() # to resample an oparation to be done monthly
df['2016-11']
df['2017']
df['2016-12':]

            Count 1  Count 2
2016-10-02      109      120
2016-10-16      106      126
2016-10-30      101      118
2016-11-13      105      124
2016-11-27      105      122
2016-12-11      109      124
2016-12-25      108      115
2017-01-08       96      126
2017-01-22      107      117

            Count 1  Count 2
2016-12-11      109      124
2016-12-25      108      115
2017-01-08       96      126
2017-01-22      107      117

In [124]:
df1 =pd.DataFrame([np.random.random(100) for x in range(10)])
df1.columns

RangeIndex(start=0, stop=100, step=1)